testTesults/stage_3/3_get_full_wrk.txt
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 7.918ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 6.620ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 6.457ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 6.742ms, rate sampling interval: 31ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.62ms   41.86ms   1.01s    99.49%
    Req/Sec     2.57k   604.97     8.63k    75.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.41ms
 75.000%    5.10ms
 90.000%   10.28ms
 99.000%   20.72ms
 99.900%  801.79ms
 99.990%  993.28ms
 99.999%    1.01s 
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.070     0.000000            1         1.00
       0.629     0.100000        80065         1.11
       1.014     0.200000       160220         1.25
       1.364     0.300000       240102         1.43
       1.790     0.400000       320058         1.67
       2.413     0.500000       399999         2.00
       2.803     0.550000       440088         2.22
       3.229     0.600000       480035         2.50
       3.729     0.650000       519998         2.86
       4.343     0.700000       560156         3.33
       5.103     0.750000       599997         4.00
       5.563     0.775000       620024         4.44
       6.111     0.800000       639950         5.00
       6.775     0.825000       659926         5.71
       7.615     0.850000       679892         6.67
       8.783     0.875000       699965         8.00
       9.487     0.887500       709947         8.89
      10.279     0.900000       719888        10.00
      11.151     0.912500       729940        11.43
      12.095     0.925000       739905        13.33
      13.119     0.937500       749906        16.00
      13.671     0.943750       754880        17.78
      14.255     0.950000       759891        20.00
      14.887     0.956250       764884        22.86
      15.575     0.962500       769903        26.67
      16.327     0.968750       774865        32.00
      16.751     0.971875       777396        35.56
      17.215     0.975000       779912        40.00
      17.727     0.978125       782355        45.71
      18.319     0.981250       784905        53.33
      18.991     0.984375       787388        64.00
      19.359     0.985938       788609        71.11
      19.823     0.987500       789867        80.00
      20.351     0.989062       791132        91.43
      21.023     0.990625       792379       106.67
      21.983     0.992188       793603       128.00
      22.863     0.992969       794235       142.22
      25.151     0.993750       794854       160.00
      31.359     0.994531       795477       182.86
     143.487     0.995313       796102       213.33
     275.455     0.996094       796727       256.00
     346.367     0.996484       797041       284.44
     413.951     0.996875       797352       320.00
     477.183     0.997266       797664       365.71
     556.031     0.997656       797978       426.67
     626.175     0.998047       798290       512.00
     662.527     0.998242       798449       568.89
     695.807     0.998437       798605       640.00
     721.919     0.998633       798758       731.43
     764.415     0.998828       798914       853.33
     806.911     0.999023       799071      1024.00
     826.879     0.999121       799149      1137.78
     849.407     0.999219       799228      1280.00
     869.375     0.999316       799305      1462.86
     888.831     0.999414       799384      1706.67
     909.823     0.999512       799461      2048.00
     919.551     0.999561       799500      2275.56
     929.791     0.999609       799540      2560.00
     937.471     0.999658       799578      2925.71
     949.247     0.999707       799618      3413.33
     960.511     0.999756       799656      4096.00
     966.655     0.999780       799676      4551.11
     972.287     0.999805       799695      5120.00
     978.431     0.999829       799716      5851.43
     983.551     0.999854       799734      6826.67
     988.671     0.999878       799755      8192.00
     991.743     0.999890       799765      9102.22
     993.791     0.999902       799776     10240.00
     995.327     0.999915       799784     11702.86
     997.887     0.999927       799793     13653.33
    1000.959     0.999939       799804     16384.00
    1001.983     0.999945       799810     18204.44
    1002.495     0.999951       799814     20480.00
    1003.519     0.999957       799818     23405.71
    1005.055     0.999963       799823     27306.67
    1006.591     0.999969       799828     32768.00
    1007.103     0.999973       799830     36408.89
    1008.127     0.999976       799833     40960.00
    1008.639     0.999979       799835     46811.43
    1009.151     0.999982       799837     54613.33
    1010.175     0.999985       799840     65536.00
    1010.687     0.999986       799842     72817.78
    1010.687     0.999988       799842     81920.00
    1011.199     0.999989       799844     93622.86
    1011.199     0.999991       799844    109226.67
    1011.711     0.999992       799845    131072.00
    1012.223     0.999993       799847    145635.56
    1012.223     0.999994       799847    163840.00
    1012.223     0.999995       799847    187245.71
    1012.735     0.999995       799850    218453.33
    1012.735     0.999996       799850    262144.00
    1012.735     0.999997       799850    291271.11
    1012.735     0.999997       799850    327680.00
    1012.735     0.999997       799850    374491.43
    1012.735     0.999998       799850    436906.67
    1012.735     0.999998       799850    524288.00
    1012.735     0.999998       799850    582542.22
    1012.735     0.999998       799850    655360.00
    1012.735     0.999999       799850    748982.86
    1013.247     0.999999       799851    873813.33
    1013.247     1.000000       799851          inf
#[Mean    =        6.617, StdDeviation   =       41.858]
#[Max     =     1012.736, Total count    =       799851]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899861 requests in 1.50m, 63.04MB read
Requests/sec:   9998.42
Transfer/sec:    717.29KB
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 9.979ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 11.654ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 7.221ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 16.827ms, rate sampling interval: 106ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.39ms    5.33ms  52.93ms   86.21%
    Req/Sec     2.53k   360.75     4.31k    75.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.64ms
 75.000%    7.20ms
 90.000%   12.65ms
 99.000%   24.46ms
 99.900%   36.96ms
 99.990%   45.89ms
 99.999%   51.78ms
100.000%   52.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.090     0.000000            1         1.00
       0.874     0.100000        80018         1.11
       1.352     0.200000       160096         1.25
       1.942     0.300000       240024         1.43
       2.735     0.400000       320031         1.67
       3.639     0.500000       400066         2.00
       4.167     0.550000       440175         2.22
       4.767     0.600000       480003         2.50
       5.439     0.650000       520084         2.86
       6.231     0.700000       560139         3.33
       7.195     0.750000       600025         4.00
       7.783     0.775000       619993         4.44
       8.463     0.800000       640004         5.00
       9.263     0.825000       660137         5.71
      10.207     0.850000       679972         6.67
      11.319     0.875000       700023         8.00
      11.951     0.887500       710058         8.89
      12.647     0.900000       720025        10.00
      13.439     0.912500       730060        11.43
      14.311     0.925000       740011        13.33
      15.263     0.937500       749977        16.00
      15.815     0.943750       755042        17.78
      16.415     0.950000       760039        20.00
      17.071     0.956250       764967        22.86
      17.855     0.962500       770010        26.67
      18.751     0.968750       774985        32.00
      19.247     0.971875       777466        35.56
      19.807     0.975000       780026        40.00
      20.431     0.978125       782474        45.71
      21.215     0.981250       784998        53.33
      22.159     0.984375       787496        64.00
      22.687     0.985938       788734        71.11
      23.295     0.987500       789979        80.00
      23.999     0.989062       791218        91.43
      24.815     0.990625       792479       106.67
      25.807     0.992188       793723       128.00
      26.399     0.992969       794339       142.22
      27.039     0.993750       794978       160.00
      27.727     0.994531       795592       182.86
      28.543     0.995313       796217       213.33
      29.503     0.996094       796845       256.00
      30.047     0.996484       797153       284.44
      30.735     0.996875       797466       320.00
      31.391     0.997266       797779       365.71
      32.175     0.997656       798089       426.67
      33.247     0.998047       798406       512.00
      33.919     0.998242       798561       568.89
      34.719     0.998437       798715       640.00
      35.519     0.998633       798880       731.43
      36.255     0.998828       799029       853.33
      37.087     0.999023       799184      1024.00
      37.567     0.999121       799260      1137.78
      38.207     0.999219       799345      1280.00
      38.815     0.999316       799418      1462.86
      39.647     0.999414       799497      1706.67
      40.479     0.999512       799573      2048.00
      41.023     0.999561       799613      2275.56
      41.631     0.999609       799652      2560.00
      42.175     0.999658       799690      2925.71
      42.911     0.999707       799729      3413.33
      43.711     0.999756       799768      4096.00
      44.127     0.999780       799789      4551.11
      44.447     0.999805       799810      5120.00
      44.767     0.999829       799827      5851.43
      45.087     0.999854       799847      6826.67
      45.407     0.999878       799868      8192.00
      45.695     0.999890       799878      9102.22
      45.887     0.999902       799885     10240.00
      46.335     0.999915       799895     11702.86
      46.975     0.999927       799905     13653.33
      47.967     0.999939       799915     16384.00
      48.383     0.999945       799921     18204.44
      48.671     0.999951       799924     20480.00
      48.895     0.999957       799929     23405.71
      49.183     0.999963       799935     27306.67
      49.535     0.999969       799939     32768.00
      49.887     0.999973       799942     36408.89
      50.047     0.999976       799944     40960.00
      50.335     0.999979       799946     46811.43
      50.783     0.999982       799949     54613.33
      51.167     0.999985       799951     65536.00
      51.423     0.999986       799953     72817.78
      51.583     0.999988       799954     81920.00
      51.775     0.999989       799955     93622.86
      51.903     0.999991       799956    109226.67
      52.095     0.999992       799957    131072.00
      52.223     0.999993       799958    145635.56
      52.383     0.999994       799959    163840.00
      52.383     0.999995       799959    187245.71
      52.575     0.999995       799960    218453.33
      52.575     0.999996       799960    262144.00
      52.767     0.999997       799961    291271.11
      52.767     0.999997       799961    327680.00
      52.767     0.999997       799961    374491.43
      52.863     0.999998       799962    436906.67
      52.863     0.999998       799962    524288.00
      52.863     0.999998       799962    582542.22
      52.863     0.999998       799962    655360.00
      52.863     0.999999       799962    748982.86
      52.959     0.999999       799963    873813.33
      52.959     1.000000       799963          inf
#[Mean    =        5.390, StdDeviation   =        5.334]
#[Max     =       52.928, Total count    =       799963]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899925 requests in 1.50m, 63.05MB read
  Non-2xx or 3xx responses: 52
Requests/sec:   9999.17
Transfer/sec:    717.34KB
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 4.967ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 4.747ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.713ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 4.553ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.83ms   60.51ms   1.00s    99.08%
    Req/Sec     2.57k   595.75     6.18k    74.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.62ms
 75.000%    7.37ms
 90.000%   13.38ms
 99.000%   51.58ms
 99.900%  918.53ms
 99.990%  988.67ms
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.112     0.000000            2         1.00
       0.870     0.100000        80040         1.11
       1.330     0.200000       160036         1.25
       1.906     0.300000       240112         1.43
       2.685     0.400000       320100         1.67
       3.623     0.500000       400076         2.00
       4.183     0.550000       439969         2.22
       4.819     0.600000       480014         2.50
       5.527     0.650000       520096         2.86
       6.359     0.700000       560094         3.33
       7.371     0.750000       600002         4.00
       7.979     0.775000       619932         4.44
       8.703     0.800000       639985         5.00
       9.559     0.825000       659973         5.71
      10.583     0.850000       679944         6.67
      11.823     0.875000       699935         8.00
      12.543     0.887500       709960         8.89
      13.375     0.900000       719980        10.00
      14.367     0.912500       729939        11.43
      15.543     0.925000       739954        13.33
      16.911     0.937500       750014        16.00
      17.695     0.943750       754981        17.78
      18.591     0.950000       759929        20.00
      19.631     0.956250       764926        22.86
      20.927     0.962500       769954        26.67
      22.719     0.968750       774929        32.00
      23.871     0.971875       777432        35.56
      25.199     0.975000       779918        40.00
      26.799     0.978125       782412        45.71
      28.735     0.981250       784919        53.33
      31.919     0.984375       787410        64.00
      33.887     0.985938       788678        71.11
      36.831     0.987500       789907        80.00
      41.919     0.989062       791162        91.43
      57.791     0.990625       792406       106.67
     245.887     0.992188       793656       128.00
     382.463     0.992969       794281       142.22
     458.751     0.993750       794906       160.00
     538.111     0.994531       795532       182.86
     615.935     0.995313       796156       213.33
     658.431     0.996094       796787       256.00
     686.591     0.996484       797101       284.44
     713.215     0.996875       797406       320.00
     749.055     0.997266       797719       365.71
     776.703     0.997656       798031       426.67
     822.783     0.998047       798344       512.00
     849.407     0.998242       798499       568.89
     861.183     0.998437       798657       640.00
     871.423     0.998633       798817       731.43
     891.903     0.998828       798975       853.33
     920.063     0.999023       799124      1024.00
     927.231     0.999121       799203      1137.78
     944.639     0.999219       799282      1280.00
     947.711     0.999316       799371      1462.86
     951.807     0.999414       799438      1706.67
     958.463     0.999512       799523      2048.00
     959.999     0.999561       799559      2275.56
     961.023     0.999609       799593      2560.00
     964.607     0.999658       799632      2925.71
     972.287     0.999707       799672      3413.33
     978.431     0.999756       799711      4096.00
     979.967     0.999780       799734      4551.11
     982.015     0.999805       799749      5120.00
     985.087     0.999829       799772      5851.43
     986.111     0.999854       799788      6826.67
     987.647     0.999878       799814      8192.00
     988.159     0.999890       799822      9102.22
     989.183     0.999902       799833     10240.00
     989.695     0.999915       799840     11702.86
     991.231     0.999927       799848     13653.33
     992.767     0.999939       799858     16384.00
     993.791     0.999945       799863     18204.44
     994.815     0.999951       799867     20480.00
     995.839     0.999957       799871     23405.71
     997.375     0.999963       799877     27306.67
     998.399     0.999969       799882     32768.00
     998.911     0.999973       799884     36408.89
     999.423     0.999976       799886     40960.00
     999.935     0.999979       799888     46811.43
    1000.447     0.999982       799891     54613.33
    1000.959     0.999985       799896     65536.00
    1000.959     0.999986       799896     72817.78
    1000.959     0.999988       799896     81920.00
    1001.471     0.999989       799900     93622.86
    1001.471     0.999991       799900    109226.67
    1001.471     0.999992       799900    131072.00
    1001.471     0.999993       799900    145635.56
    1001.983     0.999994       799905    163840.00
    1001.983     1.000000       799905          inf
#[Mean    =       10.834, StdDeviation   =       60.511]
#[Max     =     1001.472, Total count    =       799905]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899937 requests in 1.50m, 63.05MB read
Requests/sec:   9999.71
Transfer/sec:    717.38KB